[{
    "title":"Jolly LLB",
    "id":"1",
    "genre": "Action,Drama",
    "duration":"2hrs 33min",
    "year":"2015",
    "description":"Baahubali - The Beginning is a Telugu action film, directed by S. S. Rajamouli and starring Prabhas, Rana Daggubati, Tamannaah and Anushka Shetty. This epic, Telugu historical is set in the kingdom of Mahishmati. Shivudu (Prabhas) travels to the distant lands above the waterfalls to meet Avanthika (Tamannaah), a beautiful tribal warrior and helps her to rescue Devasena (Anushka Shetty) from the claws of King Bhallala Deva (Rana Daggubati). In this quest, he finds out from the commander-in-chief, Katappa (Sathyaraj) that the legendary King Baahubali (Prabhas) is his father and Devasena is his mother! Watch the full Baahubali - The Beginning movie online, streaming on Hotstar. Bahubali - The Beginning is a 2016 National Award Winner in 2 categories, Best Feature Film and Best VFX. ",
    "thumbnail":"http://media1-starag.startv.in/r1/thumbs/PCTV/38/1000074338/PCTV-1000074338-hs.jpg",
    "imageUrl":"http://media2-starag.startv.in/r1/thumbs/PCTV/38/1000074338/PCTV-1000074338-hd.jpg",
    "videoUrl":"http://www.hotstar.com/movies/baahubali-the-beginning/1000074338"
},
{
    "id":"2",
    "title":"KAABIL",
    "genre": "Action,Drama",
    "duration":"2hrs 17min",
    "year":"2017",
    "description":"Khaidi No. 150 (2017) is a Telugu action movie starring megastar Chiranjeevi and Kajal Aggarwal, directed by V.V Vinayak. Kaththi Seenu escapes from prison and plans to leave the country for good. He chance upon his lookalike, Shankar and cleverly sends him in his place to prison. But when he realises that Shankar was helping the downtrodden farmers of his village, he decides to take his place and fight for the cause. Watch Khaidi No. 150 full movie online, streaming exclusively on Hotstar. ",
    "thumbnail":"http://media2-starag.startv.in/r1/thumbs/PCTV/53/1770015353/PCTV-1770015353-hs.jpg",
    "imageUrl":"http://media2-starag.startv.in/r1/thumbs/PCTV/53/1770015353/PCTV-1770015353-hd.jpg",
    "videoUrl":"http://www.hotstar.com/movies/khaidi-no-150/1770015353"
},
{
    "id":"3",
    "title":"Hate story 3",
    "genre": "Action,Drama",
    "duration":"2hrs 33min",
    "year":"2016",
    "description":"Janatha Garage (2016) is a Telugu action movie starring Jr. NTR, Samantha, Nitya Menen and Mohanlal. Satyam starts a vehicle repairing garage in Hyderabad. He also helps people who are troubled by goons. Over a period of time, Janatha Garage becomes a place where justice is served. Anand, an environmental science student, is on a visit to Hyderabad and gets entangled over an issue, making him confront with the people of Janatha Garage. Rest of the story is about what happens when two powerful and well-intended men join hands for a noble cause. Mohanlal received Special Jury Award for Janatha Garage at 2017 National Film Awards. Watch Janatha Garage full telugu movie online, streaming only on Hotstar.",
    "thumbnail":"http://media1-starag.startv.in/r1/thumbs/PCTV/71/1000155071/PCTV-1000155071-hs.jpg",
    "imageUrl":"http://media2-starag.startv.in/r1/thumbs/PCTV/71/1000155071/PCTV-1000155071-hd.jpg",
    "videoUrl":"http://www.hotstar.com/movies/janatha-garage/1000155071"
},
{
    "id":"4",
    "title":"MS Dhoni",
    "genre": "Thriller",
    "duration":"2hrs 38min",
    "year":"2016",
    "description":"24 is a dubbed Telugu thriller, starring Suriya, Nithya Menen, Samantha Ruth Prabhu, directed by Vikram Kumar. Shiva Kumara is a scientist who invents a time-machine. Seeing the varied profits that this can generate, Shiva’s twin, Athreya kills him and his wife. Shiva Kumar somehow hides the watch and his little son and hands him over to Saranya. Years pass by, and Athreya once again comes looking for the watch which is now with Mani, son of Shiva Kumar. 24 won 2017 National Film Award for Best Production Design. Watch 24, the full movie online, only on Hotstar. ",
    "thumbnail":"http://media0-starag.startv.in/r1/thumbs/PCTV/44/1770004244/PCTV-1770004244-hs.jpg",
    "imageUrl":"http://media2-starag.startv.in/r1/thumbs/PCTV/44/1770004244/PCTV-1770004244-hd.jpg",
    "videoUrl":"http://www.hotstar.com/movies/24/1770004244"
}]
